Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Skype</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/АР_СпособыНачисленияАренднойПлаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_СпособыНачисленияАренднойПлаты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаОбъектВЦелом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезНеполногоМесяца</Name>
					<Comment>Независимо от того, за полный месяц было произведено начисление или нет, сумма начислится полностью</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_СпособыНачисления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ШаблоныДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ШаблоныДокументов</Name>
			<Comment>Шаблоны документов MS Word</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона документа MS Word DOC</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДокумент</Name>
					<Comment>Для документа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьШаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Имя файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АР_ТипыДокументовПечатныхФорм</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Comment>Хранилище</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектИК</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_УстановкаПараметровИК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВыбранныеПоля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Формат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиТЧ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/АР_ПланировкиПомещенийИПлощадей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_ПланировкиПомещенийИПлощадей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УдалитьФайлШаблона</Name>
					<Comment>Файл шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лист</Name>
					<Comment>Лист рабочей книги файла шаблона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрОбъект</Name>
					<Comment>Имя графического объекта на рабочем листе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбластьТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПланировки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ФайлыПланировокПомещенийИПлощадей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ВидыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВидыКонтактнойИнформации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводитьНомерПоМаске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьСтрануВПредставление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПоляДругое</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРедактирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьРедактированиеПользователем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяГруппы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсправлятьУстаревшиеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаНомераТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународныйФорматАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МожноИзменятьСпособРедактирования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьКорректность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроверятьПоФИАС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьВводНесколькихЗначений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкрыватьНеактуальныеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонСДобавочнымНомером</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНациональныйАдрес</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьРедактированиеТолькоВДиалоге</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УказыватьОКТМО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьИсториюИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьВсегда</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АР_ПроцедурыОбновленияИнформационнойБазы/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Обновление информационной базы библиотеки АрендаИУправлениеНедвижимостью (АР) 
//
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС

////////////////////////////////////////////////////////////////////////////////
// Сведения о библиотеке (или конфигурации).

// Заполняет основные сведения о библиотеке или основной конфигурации.
// Библиотека, имя которой имя совпадает с именем конфигурации в метаданных, определяется как основная конфигурация.
// 
// Параметры:
//  Описание - Структура - сведения о библиотеке:
//
//   Имя                 - Строка - имя библиотеки, например, "СтандартныеПодсистемы".
//   Версия              - Строка - версия в формате из 4-х цифр, например, "2.1.3.1".
//
//   ТребуемыеПодсистемы - Массив - имена других библиотек (Строка), от которых зависит данная библиотека.
//                                  Обработчики обновления таких библиотек должны быть вызваны ранее
//                                  обработчиков обновления данной библиотеки.
//                                  При циклических зависимостях или, напротив, отсутствии каких-либо зависимостей,
//                                  порядок вызова обработчиков обновления определяется порядком добавления модулей
//                                  в процедуре ПриДобавленииПодсистем общего модуля ПодсистемыКонфигурацииПереопределяемый.
//
// Для стандартных процедур в основных модулях библиотек рекомендуется использовать
// не копию комментария, а ссылку на комментарий в модуле этом модуле.
//
Процедура ПриДобавленииПодсистемы(Описание) Экспорт
	
	Описание.Имя    = "Аренда"; // имя подсистемы должно отличаться от имени конфигурации
	Описание.Версия = "3.3.2.14";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий обновления информационной базы.

// Добавляет в список процедуры-обработчики обновления данных ИБ
// для всех поддерживаемых версий библиотеки или конфигурации.
// Вызывается перед началом обновления данных ИБ для постоения плана обновления.
//
//
// Параметры:
//  Обработчики - это таблица значений, возвращаемая функцией
//                НоваяТаблицаОбработчиковОбновления модуля ОбновлениеИнформационнойБазы.
//
// Пример добавления процедуры-обработчика в список:
//  Обработчик = Обработчики.Добавить();
//  Обработчик.Версия    = "1.0.0.0";
//  Обработчик.Процедура = "ОбновлениеИБ.ПерейтиНаВерсию_1_0_0_0";
// 
//  Все свойства обработчика см. в комментарии к функции
//  НоваяТаблицаОбработчиковОбновления в модуле ОбновлениеИнформационнойБазы.
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "*";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ОбновитьДанныеПоРасположениюТиповогоФайлаПланировок";
	Обработчик.ОбщиеДанные = Истина;
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "0.0.0.1";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ПервыйЗапуск";
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.2.12.4";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ОбновитьШаблоныВордПриПереходеС20";
	Обработчик.Опциональный = Ложь; // В противном случае процедура не запустится при переходе с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.2.12.4";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ЗаполнитьКлючиСвязейТабличныхЧастейДокументаКорректировкаДолга";
	Обработчик.Опциональный = Ложь; // В противном случае процедура не запустится при переходе с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.2.12.4";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ЗаполнитьКлючиСвязейТабличныхЧастейДокументаВНО";
	Обработчик.Опциональный = Ложь; // В противном случае процедура не запустится при переходе с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.2.12.4";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ОбновитьПрисоединеныеФайлыПриПереходеС20";
	Обработчик.Опциональный = Ложь; // В противном случае процедура не запустится при переходе с 2БП на 3БП
	
	Обработчик = Обработчики.Добавить();
	Обработчик.Версия = "3.2.12.4";
	Обработчик.Процедура = "АР_ПроцедурыОбновленияИнформационнойБазы.ОбновитьФайлыПланировок";
	Обработчик.Опциональный = Ложь; 

КонецПроцедуры

// Вызывается перед процедурами-обработчиками обновления данных ИБ.
Процедура ПередОбновлениемИнформационнойБазы() Экспорт
	
КонецПроцедуры

// Вызывается после завершения монопольного обновления данных ИБ.
// 
// Параметры:
//   ПредыдущаяВерсия       - Строка - версия подсистемы до обновления. "0.0.0.0" для "пустой" ИБ.
//   ТекущаяВерсия          - Строка - версия подсистемы после обновления.
//   ВыполненныеОбработчики - ДеревоЗначений - список выполненных процедур-обработчиков обновления
//                                             подсистемы, сгруппированных по номеру версии.
//                            Процедура обхода выполненных обработчиков:
//
//	Для Каждого Версия Из ВыполненныеОбработчики.Строки Цикл
//		
//		Если Версия.Версия = "*" Тогда
//			// Обработчик, который может выполнятся при каждой смене версии.
//		Иначе
//			// Обработчик, который выполняется для определенной версии.
//		КонецЕсли;
//		
//		Для Каждого Обработчик Из Версия.Строки Цикл
//			...
//		КонецЦикла;
//		
//	КонецЦикла;
//
//   ВыводитьОписаниеОбновлений - Булево (возвращаемое значение)- если установить Истина,
//                                тогда выводить форму с описанием обновлений.
//   МонопольныйРежим           - Булево - признак выполнения обновления в монопольном режиме.
//                                Истина - обновление выполнялось в монопольном режиме.
//
Процедура ПослеОбновленияИнформационнойБазы(Знач ПредыдущаяВерсия, Знач ТекущаяВерсия,
		Знач ВыполненныеОбработчики, ВыводитьОписаниеОбновлений, МонопольныйРежим) Экспорт
	
КонецПроцедуры

// Вызывается при подготовке табличного документа с описанием изменений в программе.
//
// Параметры:
//   Макет - ТабличныйДокумент - описание обновления всех библиотек и конфигурации.
//           Макет можно дополнить или заменить.
//           См. также общий макет ОписаниеИзмененийСистемы.
//
Процедура ПриПодготовкеМакетаОписанияОбновлений(Знач Макет) Экспорт
	
	// Не используется в БСП.
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработчики обновления информационной базы

// Процедура осуществляет первоначальное заполнение подсистемы Аренда
Процедура ПервыйЗапуск() Экспорт
	
	Если ЗначениеЗаполнено(Константы.АР_УслугаАренда.Получить()) Тогда
		Возврат;
	КонецЕсли;
	
	//Создадим элемент "Аренда" в справочнике "Номенклатура" и запишем его в константу "УслугаАренда"
	УслугаАренда = Справочники.Номенклатура.НайтиПоНаименованию("Аренда недвижимости");
	Если УслугаАренда.Пустая() Тогда
		
		УслугаАрендаОбъект = Справочники.Номенклатура.СоздатьЭлемент();
		УслугаАрендаОбъект.Наименование = "Аренда недвижимости";
		УслугаАрендаОбъект.НаименованиеПолное = "Аренда недвижимости";
		УслугаАрендаОбъект.Услуга = Истина;
		УслугаАрендаОбъект.АР_ПостояннаяЧастьОплаты = Истина;
		УслугаАрендаОбъект.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("шт");
		УслугаАрендаОбъект.Записать();
		УслугаАренда = УслугаАрендаОбъект.Ссылка;
		
	КонецЕсли;
	
	ЕдиницаКвадратныеМетры = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию("м2");
	Если ЕдиницаКвадратныеМетры.Пустая() Тогда
		ЕдиницаОбъект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
		ЕдиницаОбъект.Наименование = "м2";
		ЕдиницаОбъект.НаименованиеПолное = "Квадратный метр";
		ЕдиницаОбъект.Код = "055";
		ЕдиницаОбъект.Записать();
		ЕдиницаКвадратныеМетры = ЕдиницаОбъект.Ссылка;		
	КонецЕсли;
	
	СпособНачисления = Справочники.АР_СпособыНачисленияАренднойПлаты.СоздатьЭлемент();
	СпособНачисления.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	СпособНачисления.Наименование = "В руб. за м2/месяц";
	СпособНачисления.ЕдиницаИзмерения = ЕдиницаКвадратныеМетры;
	СпособНачисления.ПериодНачисления = Перечисления.Периодичность.Месяц;
	СпособНачисления.Записать();
	
	Константы.АР_УслугаАренда.Установить(УслугаАренда);
	Константы.АР_ВестиУчетТарифицируемыхУслугПоСчетчикам.Установить(Истина);
	Константы.АР_ПериодНачисленияАренднойПлаты.Установить(Перечисления.Периодичность.Месяц);
	Константы.АР_ИспользоватьГрафикИзмененияСтавокВДоговорахАренды.Установить(Истина);
	Константы.АР_ОсновнойСпособНачисленияАрендойПлаты.Установить(СпособНачисления.Ссылка);
	Константы.АР_ПриРасчетеПениСрокОплатыРабочийДень.Установить(Истина);
	
	// Создадим и заполним производственный календарь РФ
	КалендарныеГрафики.СоздатьКалендарьПятидневкаРоссийскойФедерации();
	КалендарныеГрафики.ОбновитьПроизводственныеКалендари();
	КалендарныеГрафики.ОбновитьДанныеПроизводственныхКалендарей();
	Константы.АР_ОсновнойПроизводственныйКалендарьАренды.Установить(Справочники.ПроизводственныеКалендари.НайтиПоКоду("РФ"));
	
	КонтактнаяИнформацияОбновлениеИБНачальноеЗаполнение();
	
КонецПроцедуры

Процедура ОбновитьДанныеПоРасположениюТиповогоФайлаПланировок() Экспорт
	
	
	ПредыдущаяВерсия = СтрЗаменить(СтрЗаменить(ОбновлениеИнформационнойБазы.ВерсияИБ("АрендаИУправлениеНедвижимостью"), ".", "_"), "/", "_");
	СтароеРасположение = "C:\Program Files\1cv82\tmplts\Elias\Arenda\" + ПредыдущаяВерсия + "\Plans.XLS"; 
	ТекущаяВерсия = СтрЗаменить(СтрЗаменить(Метаданные.Версия, ".", "_"), "/", "_");
	НовоеРасположение = "C:\Program Files\1cv82\tmplts\Elias\Arenda\" + ТекущаяВерсия + "\Plans.XLS"; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Расположение", СтароеРасположение);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ФайлыПланировокПомещенийИПлощадей.Ссылка
	|ИЗ
	|	Справочник.АР_ФайлыПланировокПомещенийИПлощадей КАК АР_ФайлыПланировокПомещенийИПлощадей
	|ГДЕ
	|	НЕ АР_ФайлыПланировокПомещенийИПлощадей.ЭтоГруппа
	|	И АР_ФайлыПланировокПомещенийИПлощадей.ИмяФайла ПОДОБНО &Расположение";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ИмяФайла = НовоеРасположение;
		СправочникОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры //--ЭЛИАС 20120620

// Процедура обновляет справочник "Шаблоны документов" при переходе с 2.0
Процедура ОбновитьШаблоныВордПриПереходеС20() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АР_ШаблоныДокументов.Ссылка
	|ИЗ
	|	Справочник.АР_ШаблоныДокументов КАК АР_ШаблоныДокументов
	|ГДЕ
	|	АР_ШаблоныДокументов.ТипДокумента = Значение(Перечисление.АР_ТипыДокументовПечатныхФорм.ПустаяСсылка)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ШаблонОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ШаблонОбъект.ОбновитьДанныеПриПереходеС20();
		ШаблонОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

// Процедура перезаполняет для каждого документа "КорректировкаДолга" табличные части
// - ДебиторскаяЗадолженность
// - КредиторскаяЗадолженность
// Тут информация из поля "УдалитьКлюч" переносится в "Ключ", преобразуясь в строку
//
// Если документ ранее был проведен и не помечен на удаление, то будет выполнена попытка проведения такого документа
// В противном случае документ будет просто записан
//
Процедура ЗаполнитьКлючиСвязейТабличныхЧастейДокументаКорректировкаДолга() Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
		|// Общий список строк, где есть несконвертированный ключ
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	Док.НомерСтроки             КАК НомерСтроки
		|ПОМЕСТИТЬ
		|	ВТ_ИтогиПоДокументу
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	Док.НомерСтроки             КАК НомерСтроки
		|ИЗ
		|	Документ.КорректировкаДолга.ДебиторскаяЗадолженность КАК Док
		|ГДЕ
		|	Док.УдалитьАР_Ключ <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	Док.НомерСтроки             КАК НомерСтроки
		|ИЗ
		|	Документ.КорректировкаДолга.КредиторскаяЗадолженность КАК Док
		|ГДЕ
		|	Док.УдалитьАР_Ключ <> 0
		|) КАК Док
		|;
		|
		|// Определить, какие документы надо конвертировать
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	КОЛИЧЕСТВО(Док.НомерСтроки) КАК КоличествоСтрокДляКонвертации
		|ИЗ
		|	ВТ_ИтогиПоДокументу КАК Док
		|СГРУППИРОВАТЬ ПО
		|	Док.Ссылка,
		|	Док.Ссылка.Проведен,
		|	Док.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Док.Ссылка.Дата,
		|	Док.Ссылка
		|";
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Попытка
			Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока Выборка.Следующий() Цикл
				Если Выборка.КоличествоСтрокДляКонвертации > 0 Тогда
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ДокументОбъект.ВыполнитьКонвертациюКлючейСвязиТабличныхЧастейПриПереходеС2БП();
					Если (Выборка.ПометкаУдаления) ИЛИ (НЕ Выборка.Проведен) Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					Иначе
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Исключение
			ТекстСообщения = НСтр("ru='Операция не выполнена'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Процедура перезаполняет для каждого документа "ВводНачальныхОстатков" табличные части
// - МПЗОтгруженные
// - ДанныеПоСФ
// Тут информация из поля "УдалитьКлюч" переносится в "Ключ", преобразуясь в строку
//
// Другие табличные части (
// - НоменклатураНаСкладе (брать из УдалитьМПЗПриобретенные)
// - СпецодеждаИСпецоснасткаВЭксплуатации (брать из УдалитьМПЗПриобретенные)
// - МатериалыПереданныеВПереработку (брать из УдалитьМПЗПриобретенные)
// - ТоварыВРозничнойТорговлеАТТ (брать из УдалитьМПЗПриобретенные)
// - ТоварыВРозничнойТорговлеНТТ (брать из УдалитьМПЗПриобретенные)
// ) уже должны быть сконвертированы в процедуре ЗаполнитьТабличныеЧастиНоменклатурыДокументаВНО
//
// Не трогать: ////?
// - Обороты
// - МПЗРеализованныеИП
//
// Если документ ранее был проведен и не помечен на удаление, то будет выполнена попытка проведения такого документа
// В противном случае документ будет просто записан
//
Процедура ЗаполнитьКлючиСвязейТабличныхЧастейДокументаВНО() Экспорт

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "
		|// Общий список строк, где есть несконвертированный ключ
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	Док.НомерСтроки             КАК НомерСтроки
		|ПОМЕСТИТЬ
		|	ВТ_ИтогиПоДокументу
		|ИЗ
		|(
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	Док.НомерСтроки             КАК НомерСтроки
		|ИЗ
		|	Документ.ВводНачальныхОстатков.РасчетыСКонтрагентами КАК Док
		|ГДЕ
		|	Док.УдалитьАР_Ключ <> 0) КАК Док
		|;
		|
		|// Определить, какие документы надо конвертировать
		|ВЫБРАТЬ
		|	Док.Ссылка                  КАК Ссылка,
		|	Док.Ссылка.Проведен         КАК Проведен,
		|	Док.Ссылка.ПометкаУдаления  КАК ПометкаУдаления,
		|	КОЛИЧЕСТВО(Док.НомерСтроки) КАК КоличествоСтрокДляКонвертации
		|ИЗ
		|	ВТ_ИтогиПоДокументу КАК Док
		|СГРУППИРОВАТЬ ПО
		|	Док.Ссылка,
		|	Док.Ссылка.Проведен,
		|	Док.Ссылка.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Док.Ссылка.Дата,
		|	Док.Ссылка
		|";
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Попытка
			Выборка = Результат.Выбрать(ОбходРезультатаЗапроса.Прямой);
			Пока Выборка.Следующий() Цикл
				Если Выборка.КоличествоСтрокДляКонвертации > 0 Тогда
					ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
					ДокументОбъект.ВыполнитьКонвертациюКлючейСвязиРасчетовСКонтрагентамиПриПереходеС2БП();
					Если (Выборка.ПометкаУдаления) ИЛИ (НЕ Выборка.Проведен) Тогда
						ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
					Иначе
						ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Исключение
			ТекстСообщения = НСтр("ru='Операция не выполнена'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

// Процедура переносит данные справочника "УдалитьАР_ХранилищеДополнительнойИнформации"
// в соответсвующи справочники при переходе с 2.0
Процедура ОбновитьПрисоединеныеФайлыПриПереходеС20() Экспорт
	
	СписокСправочников = Новый СписокЗначений;
	СписокСправочников.Добавить("АР_ОбъектыАрендыПрисоединенныеФайлы");
	СписокСправочников.Добавить("АР_АктПриемаВозвратаАрендуемогоПомещенияПрисоединенныеФайлы");
	СписокСправочников.Добавить("АР_АктПриемаПередачиПомещенияВАрендуПрисоединенныеФайлы");
	//СписокСправочников.Добавить("КонтрагентыПрисоединенныеФайлы");
	
	СписокОбновляемыхСправочников = Новый СписокЗначений;
	
	Для каждого Элемент Из СписокСправочников Цикл
		Если Не Справочники[Элемент.Значение].Выбрать().Следующий() Тогда
			СписокОбновляемыхСправочников.Добавить(Элемент.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УдалитьАР_ХранилищеДополнительнойИнформации.Ссылка,
	|	УдалитьАР_ХранилищеДополнительнойИнформации.ИмяФайла,
	|	УдалитьАР_ХранилищеДополнительнойИнформации.Объект,
	|	УдалитьАР_ХранилищеДополнительнойИнформации.Хранилище,
	|	УдалитьАР_ХранилищеДополнительнойИнформации.ВидДанных,
	|	УдалитьАР_ХранилищеДополнительнойИнформации.Наименование
	|ИЗ
	|	Справочник.УдалитьАР_ХранилищеДополнительнойИнформации КАК УдалитьАР_ХранилищеДополнительнойИнформации";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ИмяОбъекта = Выборка.Объект.Метаданные().Имя;
		Если СписокОбновляемыхСправочников.НайтиПоЗначению(ИмяОбъекта + "ПрисоединенныеФайлы") = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ВидДанных = Перечисления.УдалитьАР_ВидыДополнительнойИнформацииОбъектов.Изображение Тогда
			ИмяБезРасширения = Выборка.Наименование;
			Расширение = "";
		Иначе 
			Расширение = ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(Выборка.ИмяФайла);
			Если ЗначениеЗаполнено(Расширение) Тогда
				ИмяБезРасширения = Лев(Выборка.ИмяФайла, СтрДлина(Выборка.ИмяФайла) - СтрДлина(Расширение) - 1);
			Иначе
				ИмяБезРасширения = Выборка.ИмяФайла;
			КонецЕсли;
		КонецЕсли;
		
		ДвоичныеДанные = Выборка.Хранилище.Получить();
		Если ТипЗнч(ДвоичныеДанные) = Тип("Картинка") Тогда
			Расширение = Строка(ДвоичныеДанные.Формат());
			ДвоичныеДанные = ДвоичныеДанные.ПолучитьДвоичныеДанные();
		КонецЕсли;
		
		АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПрисоединенныйФайл = РаботаСФайламиВТомахСлужебный.ДобавитьФайл(
			Выборка.Объект,
			ИмяБезРасширения,
			Расширение,
			Неопределено,
			Неопределено,
			АдресВременногоХранилищаФайла,
			"");
			
	КонецЦикла;
		
КонецПроцедуры

Процедура ОбновитьФайлыПланировок() Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(АР_ПланировкиПомещенийИПлощадей.УдалитьФайлШаблона КАК СТРОКА(1000)) КАК ИмяФайла,
	|	АР_ПланировкиПомещенийИПлощадей.Ссылка
	|ИЗ
	|	Справочник.АР_ПланировкиПомещенийИПлощадей КАК АР_ПланировкиПомещенийИПлощадей
	|ГДЕ
	|	АР_ПланировкиПомещенийИПлощадей.ФайлПланировки = ЗНАЧЕНИЕ(Справочник.АР_ФайлыПланировокПомещенийИПлощадей.ПустаяСсылка)
	|ИТОГИ ПО
	|	ИмяФайла";
	
	ВыборкаФайлы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаФайлы.Следующий() Цикл
		
		Файл = Новый Файл(ВыборкаФайлы.ИмяФайла);
		Если Не Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		ФайлПланировки = Справочники.АР_ФайлыПланировокПомещенийИПлощадей.СоздатьЭлемент();
		ФайлПланировки.ИмяФайла = ВыборкаФайлы.ИмяФайла;
		ФайлПланировки.Наименование = Файл.ИмяБезРасширения;
		ФайлПланировки.Записать();
		
		Выборка = ВыборкаФайлы.Выбрать();
		Пока Выборка.Следующий() Цикл
			ПланировкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ПланировкаОбъект.ФайлПланировки = ФайлПланировки.Ссылка;
			ПланировкаОбъект.Записать();
		КонецЦикла;
		
	КонецЦикла;	
	
КонецПроцедуры 

///////////////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ Аренды

// Процедура обновляет элементы справочника Виды контактной информации
Процедура КонтактнаяИнформацияОбновлениеИБНачальноеЗаполнение() Экспорт
	
	// Объекты аренды
	УправлениеКонтактнойИнформацией.ОбновитьВидКИ(Справочники.ВидыКонтактнойИнформации.АдресОбъектаАренды, Перечисления.ТипыКонтактнойИнформации.Адрес, Истина, Ложь, Ложь, 1);
	
КонецПроцедуры
